stress/reports/stress_test_20201216_pm2.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            9091

Document Path:          /cards/card?id=5fd9f52c74463790065e3224
Document Length:        48 bytes

Concurrency Level:      1000
Time taken for tests:   100.199 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      8190000 bytes
HTML transferred:       480000 bytes
Requests per second:    99.80 [#/sec] (mean)
Time per request:       10019.884 [ms] (mean)
Time per request:       10.020 [ms] (mean, across all concurrent requests)
Transfer rate:          79.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   7.0      0      35
Processing:    98 9500 2162.1   9179   13963
Waiting:       63 9499 2161.9   9176   13962
Total:         98 9502 2157.2   9179   13963

Percentage of the requests served within a certain time (ms)
  50%   9179
  66%  10027
  75%  10999
  80%  11055
  90%  12002
  95%  12067
  98%  13000
  99%  13024
 100%  13963 (longest request)